[
    {
        "name": "Github Forks",
        "weight": "0.1",
        "description": "A fork is a personal copy of another user's repository that lives on your account. Forks allow you to freely make changes to a project without affecting the original. Forks remain attached to the original, allowing you to submit a pull request to the original's author to update with your changes. You can also keep your fork up to date by pulling in updates from the original"
    },
    {
        "name": "Github Closed Issues",
        "weight": "0.05",
        "description": "This value represents the amount of issues, or tasks within a to-do list, that have been completed."
    },
    {
        "name": "Github Stars",
        "weight": "0.2",
        "description": "The amount of stars users have given."
    },
    {
        "name": "Github New Commits",
        "weight": "0.1",
        "description": "A commit, or \"revision\", is an individual change to a file (or set of files). It's like when you save a file, except with Git, every time you save it creates a unique ID (a.k.a. the \"SHA\" or \"hash\") that allows you to keep record of what changes were made when and by who. Commits usually contain a commit message which is a brief description of what changes were made."
    },
    {
        "name": "Github Contributors",
        "weight": "0.2",
        "description": "A contributor is someone who has contributed to a project by having a pull request merged but does not have collaborator access."
    },
    {
        "name": "Github Merged Pull Requests",
        "weight": "0.1",
        "description": "Merging takes the changes from one branch (in the same repository or from a fork), and applies them into another. This often happens as a pull request (which can be thought of as a request to merge), or via the command line. A merge can be done automatically via a pull request via the GitHub web interface if there are no conflicting changes, or can always be done via the command line."
    },
    {
        "name": "Github Open Issues",
        "weight": "0.05",
        "description": "This value represents the amount of issues, or tasks within a to-do list, that have are still in progress."
    },
    {
        "name": "Github Watchers",
        "weight": "0.2",
        "description": "A watcher receives notifications on new discussions, as well as events in their activity feed."
    }
]